export const RANKS = [
    'พลฯ',         'พลอาสาสมัคร', 'จ.ต.กองฯ',
    'กห.ป.(ญ)',    'กห.ป.(ช)',   'จ.ต.หญิง',
    'จ.ต.',        'จ.ท.หญิง',    'จ.ท.',
    'จ.อ.หญิง',     'จ.อ.',       'พ.อ.ต.หญิง',
    'พ.อ.ต.',      'พ.อ.ท.หญิง',  'พ.อ.ท.',
    'พ.อ.อ.หญิง',   'พ.อ.อ.',     'พ.อ.อ.(พ) หญิง',
    'พ.อ.อ.(พ)',   'กห.ส.(ญ)',   'กห.ส.(ช)',
    'ร.ต.หญิง',     'ร.ต.',       'ร.ท.หญิง',
    'ร.ท.',        'ร.อ.หญิง',    'ร.อ.',
    'น.ต.หญิง',     'น.ต.',       'น.ท.หญิง',
    'น.ท.',        'น.อ.หญิง',    'น.อ.',
    'น.อ.(พ) หญิง', 'น.อ.(พ)',    'พล.อ.ต.หญิง',
    'พล.อ.ต.',     'พล.อ.ท.หญิง', 'พล.อ.ท.',
    'พล.อ.อ.หญิง',  'พล.อ.อ.',    'พล.อ.อ.*หญิง',
    'พล.อ.อ.*'
  ]
  
  export const personprops = {
    rank: {
        name: "RANK",
        label: "ยศ",
        required: true,
        type: 'select',
        options: RANKS
    },
    name: {
        name: "NAME",
        label: "ชื่อ",
        required: true
    },
    surname: {
        name: "SURNAME",
        label: "นามสกุล",
        required: true
    }
}